**English:** Import pandas and numpy, then create a DataFrame with some missing values.
**Hindi:** Pandas aur numpy import karein, fir kuchh missing values ke saath ek DataFrame banayein.

In [1]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Sachin', 'Ravi', np.nan, 'Amit', 'Sneha'],
    'Age': [21, 25, 23, 24, np.nan],
    'Department': [np.nan, 'HR', 'Finance', 'IT', 'HR'],
    'Salary': [35000, 40000, 38000, pd.NA, 42000]
}
df = pd.DataFrame(data)

**English:** Display the initial DataFrame to check its structure and missing values.
**Hindi:** DataFrame ka structure aur missing values check karne ke liye use display karein.

In [2]:
df

     Name   Age Department Salary
0  Sachin  21.0        NaN  35000
1    Ravi  25.0         HR  40000
2     NaN  23.0    Finance  38000
3    Amit  24.0         IT   <NA>
4   Sneha   NaN         HR  42000

**English:** Perform initial data exploration: check shape, count missing values, get info, describe statistics, and check for duplicates.
**Hindi:** Shuruaati data exploration karein: shape check karein, missing values ginein, info prapt karein, statistics describe karein, aur duplicates check karein.

In [3]:
df.shape

(5, 4)

In [4]:
df.isna().sum()

Name          1
Age           1
Department    1
Salary        1
dtype: int64

In [5]:
df.duplicated().sum()

np.int64(0)

**English:** Manually fill in the missing values using `.loc`, `.iloc`, and `.iat` for demonstration.
**Hindi:** Demonstration ke liye `.loc`, `.iloc`, aur `.iat` ka istemal karke missing values ko manually fill karein.

In [6]:
df.loc[2,'Name'] = 'priya'

In [7]:
df.iloc[4,1] = 24

In [8]:
df.iat[3,3] = 400000

In [9]:
df.loc[0,'Department'] = 'IT'

**English:** Convert data types to integer for clean data and check for any remaining missing values.
**Hindi:** Clean data ke liye data types ko integer mein convert karein aur bache hue missing values check karein.

In [10]:
df['Age'] = df['Age'].astype(int)
df['Salary'] = df['Salary'].astype(int)

In [11]:
df.isna().sum()

Name          0
Age           0
Department    0
Salary        0
dtype: int64

**English:** Display the fully cleaned DataFrame.
**Hindi:** Poori tarah se clean kiya gaya DataFrame display karein.

In [12]:
df

     Name  Age Department  Salary
0  Sachin   21         IT   35000
1    Ravi   25         HR   40000
2   priya   23    Finance   38000
3    Amit   24         IT  400000
4   Sneha   24         HR   42000

**English:** Group by 'Department' and find the average, max, and min salary for each.
**Hindi:** 'Department' se group karein aur har ek ke liye average, max, aur min salary nikalein.

In [13]:
df.groupby('Department').agg(
    avg_salary = ('Salary','mean'),
    max_salary = ('Salary','max'),
    min_salary = ('Salary','min')
).round()

            avg_salary  max_salary  min_salary
Department
Finance        38000.0       38000       38000
HR             41000.0       42000       40000
IT            217500.0      400000       35000

**English:** Sort the DataFrame by 'Salary' in descending order to see the top 3 earners.
**Hindi:** Top 3 earners dekhne ke liye DataFrame ko 'Salary' ke hisab se descending order mein sort karein.

In [14]:
df.sort_values(by='Salary', ascending=False).head(3)

    Name  Age Department  Salary
3   Amit   24         IT  400000
4  Sneha   24         HR   42000
1   Ravi   25         HR   40000

**English:** Filter the DataFrame to show employees with salaries greater than 40,000.
**Hindi:** 40,000 se zyada salary wale employees ko dikhane ke liye DataFrame filter karein.

In [15]:
df[df['Salary'] > 40000]['Name']

3     Amit
4    Sneha
Name: Name, dtype: object

**English:** Create a new 'bonus' column calculated as 10% of the salary.
**Hindi:** Salary ka 10% calculate karke ek naya 'bonus' column banayein.

In [16]:
df['bonus'] =df['Salary'] * 0.10

In [17]:
df['bonus'] = df['bonus'].astype(int)

**English:** Create a new column that ranks employees based on their salary in descending order.
**Hindi:** Ek naya column banayein jo employees ko unki salary ke aadhar par descending order mein rank karta hai.

In [18]:
df['rank_by_salary']=df['Salary'].rank(method = 'dense',ascending=False)

**English:** Display the final DataFrame with the new bonus and rank columns.
**Hindi:** Naye bonus aur rank columns ke saath final DataFrame display karein.

In [19]:
df

     Name  Age Department  Salary  bonus  rank_by_salary
0  Sachin   21         IT   35000   3500             5.0
1    Ravi   25         HR   40000   4000             3.0
2   priya   23    Finance   38000   3800             4.0
3    Amit   24         IT  400000  40000             1.0
4   Sneha   24         HR   42000   4200             2.0